Revit 2026 API

# RuledSurfaceGetFirstProfileCurve Method

---

Returns a copy of the first profile curve if it is set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Curve GetFirstProfileCurve()
```
```vb
Public Function GetFirstProfileCurve As Curve
```
```cpp
public:
Curve^ GetFirstProfileCurve()
```
```fsharp
member GetFirstProfileCurve : unit -> Curve
```

#### Return Value

Curve A copy of the first profile curve, if it exists. If a point was used to define the first profile, this function will return .

#### Reference

RuledSurface Class

Autodesk.Revit.DB Namespace